app/controllers/events_controller.rb

INSERT INTO "events" ("title", "price", "date", "location", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "test"], ["price", "50.0"], ["date", "TBD"], ["location", "TBD"], ["created_at", "2017-05-31 18:27:19.859978"], ["updated_at", "2017-05-31 18:27:19.859978"]]
---
  def create
    @event = Event.new(event_params)
    @event.user_id = params[:user_id]

    if @event.save

UPDATE "events" SET "title" = $1, "price" = $2, "date" = $3, "location" = $4, "updated_at" = $5 WHERE "events"."id" = $6  [["title", "Rafting"], ["price", "0.0"], ["date", "tbd"], ["location", "tbd"], ["updated_at", "2017-06-01 05:36:15.380830"], ["id", 2]]
---
  def update
    if @event.update(event_params)