app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @users = User.all.reverse

INSERT INTO "users" ("name", "email", "phone", "office", "event_pos", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "t"], ["email", "t"], ["phone", 4444], ["office", "t"], ["event_pos", "t"], ["created_at", "2017-05-29 04:15:48.716348"], ["updated_at", "2017-05-29 04:15:48.716348"]]
---
  def create
        @user = User.new(user_params)

        if @user.save

UPDATE "users" SET "name" = $1, "phone" = $2, "office" = $3, "event_pos" = $4, "updated_at" = $5 WHERE "users"."id" = $6  [["name", "Baller"], ["phone", 444], ["office", "some"], ["event_pos", "asdf"], ["updated_at", "2017-06-01 16:34:02.676497"], ["id", 1]]
---
  def update
    if @user.update(user_params)